IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/LIN3_LIN3.xml
	<register id="LIN3_SCIPIO4" acronym="LIN3_SCIPIO4" offset="0x4C" width="32" description="Pin control Register 4">
		<bitfield id="TXSET" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin set.This bit is effective in LIN or SCI mode. This bit sets the logic to be output on pin LINTX." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="RXSET" width="1" begin="1" end="1" resetval="0x0" description="Receive pin set.This bit is effective in LIN or SCI mode. This bit sets the logic to be output on pin LINRX." range="1" rwaccess="R/W1TS"/>
	</register>
	<register id="LIN3_SCIPIO5" acronym="LIN3_SCIPIO5" offset="0x50" width="32" description="Pin control Register 5">
		<bitfield id="TXCLR" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin clear.This bit is effective in LIN or SCI mode. This bit clears the logic to be output on pin LINTX." range="2" rwaccess="R/W1TC"/> 
		<bitfield id="RXCLR" width="1" begin="1" end="1" resetval="0x0" description="Receive pin clear.This bit is effective in LIN or SCI mode. This bit clears the logic to be output on pin LINRX." range="1" rwaccess="R/W1TC"/>
	</register>
	<register id="LIN3_SCIPIO6" acronym="LIN3_SCIPIO6" offset="0x54" width="32" description="Pin control Register 6">
		<bitfield id="TXPDR" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin open drain enable.This bit is effective in LIN or SCI mode. This bit enables open-drain capability in the output pin LINTX." range="2" rwaccess="R/W"/> 
		<bitfield id="RXPDR" width="1" begin="1" end="1" resetval="0x0" description="Receive pin open drain enable.This bit is effective in LIN or SCI mode. This bit enables open-drain capability in the output pin LINRX." range="1" rwaccess="R/W"/>
	</register>
	<register id="LIN3_SCIPIO7" acronym="LIN3_SCIPIO7" offset="0x58" width="32" description="Pin control Register 7">
		<bitfield id="TXPD" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin pull control disable.This bit is effective in LIN or SCI mode. This bit disables pull control capability on the input pin LINTX." range="2" rwaccess="R/W"/> 
		<bitfield id="RXPD" width="1" begin="1" end="1" resetval="0x0" description="Receive pin pull control disable.This bit is effective in LIN or SCI mode. This bit disables pull control capability on the input pin LINRX." range="1" rwaccess="R/W"/>
	</register>
	<register id="LIN3_SCIPIO8" acronym="LIN3_SCIPIO8" offset="0x5C" width="32" description="Pin control Register 8">
		<bitfield id="TXPSL" width="1" begin="2" end="2" resetval="0x1" description="TX pin pull select.This bit is effective in LIN or SCI mode. This bit selects pull type in the input pin LINTX." range="2" rwaccess="R/W"/> 
		<bitfield id="RXPSL" width="1" begin="1" end="1" resetval="0x1" description="RX pin pull select.This bit is effective in LIN or SCI mode. This bit selects pull type in the input pin LINRX." range="1" rwaccess="R/W"/>
	</register>
	<register id="LIN3_LINCOMP" acronym="LIN3_LINCOMP" offset="0x60" width="32" description="The LINCOMPARE register is used to configure the sync delimeter and sync break extension.">
		<bitfield id="SDEL" width="2" begin="9" end="8" resetval="0x0" description="2-bit Sync Delimiter compare.These bits are effective in LIN mode only. These bits are used to configure the number of Tbit for the sync delimiter in the sync field.The time delay calculation for the synchronization delimiter is:TSDEL = [SDEL + 1]Tbit These bits are writable in LIN mode only." range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="SBREAK" width="3" begin="2" end="0" resetval="0x0" description="3-bit Sync Break extend.LIN mode only. These bits are used to configure the number of Tbits for the sync break to extend the minimum 13 Tbit in the Sync Field to a maximum of 20 Tbit.The time delay calculation for the sync break is:TSYNBRK = 13Tbit + SBREAK x Tbit These bits are writable in LIN mode only." range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="LIN3_LINRD0" acronym="LIN3_LINRD0" offset="0x64" width="32" description="The LINRD0 register contains the lower 4 bytes of the received LIN frame data.">
		<bitfield id="RD0" width="8" begin="31" end="24" resetval="0x0" description="8-bit Receive Buffer 0Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received.A read of this byte clears the RXDY byte.Note: RD&#38;#60;x-1> is equivalent to Data byte &#38;#60;x> of the LIN frame." range="31 - 24" rwaccess="R"/> 
		<bitfield id="RD1" width="8" begin="23" end="16" resetval="0x0" description="8-bit Receive Buffer 1.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="23 - 16" rwaccess="R"/> 
		<bitfield id="RD2" width="8" begin="15" end="8" resetval="0x0" description="8-bit Receive Buffer 2.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="15 - 8" rwaccess="R"/> 
		<bitfield id="RD3" width="8" begin="7" end="0" resetval="0x0" description="8-bit Receive Buffer 3.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="7 - 0" rwaccess="R"/>
	</register>
	<register id="LIN3_LINRD1" acronym="LIN3_LINRD1" offset="0x68" width="32" description="The LINRD1 regsiter contains the upper 4 bytes of the received LIN frame data.">
		<bitfield id="RD4" width="8" begin="31" end="24" resetval="0x0" description="8-bit Receive Buffer 4 Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="31 - 24" rwaccess="R"/> 
		<bitfield id="RD5" width="8" begin="23" end="16" resetval="0x0" description="8-bit Receive Buffer 5.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="23 - 16" rwaccess="R"/> 
		<bitfield id="RD6" width="8" begin="15" end="8" resetval="0x0" description="8-bit Receive Buffer 6.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="15 - 8" rwaccess="R"/> 
		<bitfield id="RD7" width="8" begin="7" end="0" resetval="0x0" description="8-bit Receive Buffer 7.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="7 - 0" rwaccess="R"/>
	</register>
	<register id="LIN3_LINMASK" acronym="LIN3_LINMASK" offset="0x6C" width="32" description="The LINMASK register is used to configure the masks used for filtering incoming ID messages for receive and transmit frames.">
		<bitfield id="RXIDMASK" width="8" begin="23" end="16" resetval="0x0" description="Receive ID mask.This field is effective in LIN mode only.This 8-bit mask is used for filtering an incoming ID message and compare it to the ID-byte. A compare match of the received ID witht the RX ID mask will set the ID RX flag and trigger and ID interrupt if enabled. A 0 bit in the mask indicates that bit is compared to the ID-byte. A 1 bit in the mask indicates that that bit is filtered and therefore not used in the compare. When HGENCTRL is set to 1, this field must be set to 0xFF." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TXIDMASK" width="8" begin="7" end="0" resetval="0x0" description="Transmit ID mask.This field is effective in LIN mode only. This 8-bit mask is used for filtering an incoming ID message and compare it to the ID-byte. A compare match of the received ID with the TX ID Mask will set the ID TX flag and trigger an ID interrupt if enabled. A 0 bit in the mask indicates that bit is compared to the ID-byte. A 1 bit in the mask indicates that bit is filtered and therefore not used for the compare. When HGENCTRL is set to 1, this field must be set to 0xFF." range="7 - 0" rwaccess="R/W"/>
	</register>
