IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/LIN3_LIN3.xml
	<register id="LIN3_Reserved_2" acronym="LIN3_Reserved_2" offset="0x94" width="32" description="tbd">
		
	</register>
	<register id="LIN3_LIN_GLB_INT_EN" acronym="LIN3_LIN_GLB_INT_EN" offset="0xE0" width="32" description="The LIN_GLB_INT_EN register is used to enable the INT0 and INT1 interrupt lines to propagate to the PIE block.">
		<bitfield id="GLBINT1_EN" width="1" begin="1" end="1" resetval="0x0" description="Global Interrupt Enable for LIN INT1.This bit determines whether the INT1 interrupt line generates an interrupt to the PIE or not" range="1" rwaccess="R/W"/> 
		<bitfield id="GLBINT0_EN" width="1" begin="0" end="0" resetval="0x0" description="Global Interrupt Enable for LIN INT0.This bit determines whether the INT0 interrupt line generates an interrupt to the PIE or not." range="0" rwaccess="R/W"/>
	</register>
	<register id="LIN3_LIN_GLB_INT_FLG" acronym="LIN3_LIN_GLB_INT_FLG" offset="0xE4" width="32" description="The LIN_GLB_INT_FLG register contains the current status of the INT0 and INT1 flags.">
		<bitfield id="INT1_FLG" width="1" begin="1" end="1" resetval="0x0" description="Global Interrupt Flag for LIN INT1.This bit indicates if an interrupt was generated to the PIE due to an enabled interrupt on the INT1 interrupt line. Refer to the LIN Interrupt Status Register for the condition that generated the interrupt.This bit can be cleared by writing a 1 to the corresponding bit in the LIN_GLB_INT_CLR register." range="1" rwaccess="R"/> 
		<bitfield id="INT0_FLG" width="1" begin="0" end="0" resetval="0x0" description="Global Interrupt Flag for LIN INT0.This bit indicates if an interrupt was generated to the PIE due to an enabled interrupt on the INT0 interrupt line. Refer to the LIN Interrupt Status Register for the condition that generated the interrupt.This bit can be cleared by writing a 1 to the corresponding bit in the LIN_GLB_INT_CLR register." range="0" rwaccess="R"/>
	</register>
	<register id="LIN3_LIN_GLB_INT_CLR" acronym="LIN3_LIN_GLB_INT_CLR" offset="0xE8" width="32" description="The LIN_GLB_INT_CLR register is used to clear the interrupt flags in LIN_GLB_INT_FLG register.">
		<bitfield id="INT1_FLG_CLR" width="1" begin="1" end="1" resetval="0x0" description="Global Interrupt flag clear for LIN INT1.This bit is used to clear the corresponding bit in the LIN_GLB_INT_FLG register. Write 1 to clear the INT1_FLG bit. Writing 0 has no effect." range="1" rwaccess="R/W1TC"/> 
		<bitfield id="INT0_FLG_CLR" width="1" begin="0" end="0" resetval="0x0" description="Global Interrupt flag clear for LIN INT0.This bit is used to clear the corresponding bit in the LIN_GLB_INT_FLG register. Write 1 to clear the INT0_FLG bit. Writing 0 has no effect." range="0" rwaccess="R/W1TC"/>
	</register>
</module>